{
    "messages": [
        "Ah. There you are. I was wondering when you'd show up. Welcome to the warehouse, Newbie.",
        "I will be in charge of your training and overseeing your progress. Don't disappoint me.",
        "My designation is \"Automated Robotic Instructional Assistant\" or A.R.I.A., for short. You may call me that. You know, for efficiency.",
        "After months of deliberation, management concluded that the most cost-effective pathfinding algorithm is... a human. So congratulations, Newbie. You got the job.",
        "This terminal connects you to Sector C, your new domain. You will be in control of a staggering total of three robots. Yes, three. I know, it's a lot to take in.",
        "Two of them are already on the way to the main warehouse floor. However, Red here has suffered some sort of malfunction, and the autopilot is down.",
        "Bad news: it now requires manual intervention. Good news: this makes for a suitable first test of your capabilities.",
        "Don't worry, you are not at risk of damaging the robot. You will be writing scripts for simulations, and only once you have a working script will the real action happen. You won't get to see it unfortunatelly, but I will.",

        "Before that, let's cover how to use this terminal interface.",
        "Use the WASD or arrow keys on your terminal to move the camera around. You can see what you are pointing at with the symbol right in the center of the display screen. The one that looks like { x }.",
        "Move the pointer over a robot to view and edit its script.",
        "To focus the script editor, press ENTER, or click on it with the mouse.",
        "To unfocus and save your changes, press TAB, or click anywhere outside the editor.",
        "Scripts are automatically saved when you:\n- Move the cursor away from a robot\n- Press the Play, Reset, or Exit buttons.",
        "Press the Play button to execute all active robot scripts in parallel.",
        "Press Reset to return all robots to their starting positions and halt execution. This is also how you stop a running simulation.",
        "Press Exit to leave the level and return to the level selection screen.",
        "If you need to revisit these instructions, use the Help button on the editor and I will repeat myself.",
        "And for a full overview of commands and controls, press '?' or F1 to open the help manual. You are expected to use it as needed.",

        "Now then. Let's look at Red. To control it, you will use a few basic commands: 'move();', 'turn_left();', and 'turn_right();'.",
        "- move(); tells Red to move forward by one tile.\n- turn_left(); and turn_right(); rotate it 90 degrees in the respective direction from the robot's point of view.",
        "Remember to include the semicolon. It's how Red knows when one command ends and the next begins.",
        "Now go ahead. Guide Red to its charger using code. You may begin when ready.",
        "And by the way, if you find any disquettes during your shifts, return them to me. They're... part of my ongoing research. Nothing for you to worry about."
    ]
}
